
[{"title":"Getting a Git Repository", "body":"<p> First start by initializing a Repository in an Existing Directory. To do this start by switching directories to the project you want to control with Git.</p> <p> for Linux: </p> <p> $ cd /home/user/my_project </p> <p> for Mac: </p> <p>$ cd /Users/user/my_project</p> <p>for Windows: </p><p>$ cd /c/user/my_project</p><p> then type: </p> <p>$ git init</p> <p> This creates a new subdirectory named .git that contains all of your necessary repository files - a Git repository skeleton. To start version-controlling existing files use the following:</p><p>$ git add *.c</p><p>$ git add LICENSE</p><p>$ git commit -m 'initial project version' </p>""<p>Cloning an Existing Repository</p>" "<p>To clone an existing git repository, use: git clone <url> For example to clone the Git linkable library, libgit2 you could use: </p><p>$ git clone https://github.com/libgit2/libgit2</p> <p>This creates a directory named libgit2, initializes a .git directory inside it, pulls down all the data for that repository, and checks out a working copy of the latest version. </p> <p> To clone a repository into a directory named something other than libgit2, try: </p><p>git clone https://github.com/libgit2/libgit2 mylibgit</p><p> This does the same thing as the previous command but the target directory is called mylibgit</p>"}, {"title":"Git Basics- Recording Changes to the Repository", "body":"<p> At this point, you should have a bona fide Git repository on your local machine, and a checkout or working copy of all of its files in front of you. Typically, you’ll want to start making changes and committing snapshots of those changes into your repository each time the project reaches a state you want to record.</p> <p> Remember that each file in your working directory can be in one of two states: tracked or untracked. Tracked files are files that were in the last snapshot; they can be unmodified, modified, or staged. In short, tracked files are files that Git knows about.</p> <p> Untracked files are everything else — any files in your working directory that were not in your last snapshot and are not in your staging area. When you first clone a repository, all of your files will be tracked and unmodified because Git just checked them out and you haven’t edited anything.</p> <p> As you edit files, Git sees them as modified, because you’ve changed them since your last commit. As you work, you selectively stage these modified files and then commit all those staged changes, and the cycle repeats.</p>"} ,{"title":"Checking the Status of Your Files","body":"<p>The main tool you use to determine which files are in which state is the git status command. If you run this command directly after a clone, you should see something like this:</p><p>$ git status </p><p> On branch master</p><p> Your branch is up-to-date with 'origin/master'.</p> <p>nothing to commit, working directory clean </p> <p> This means you have a clean working directory — in other words, none of your tracked files are modified. Git also doesn’t see any untracked files, or they would be listed here. Finally, the command tells you which branch you’re on and informs you that it has not diverged from the same branch on the server. For now, that branch is always “master”, which is the default; you won’t worry about it here. Git Branching will go over branches and references in detail. </p> <p> Let’s say you add a new file to your project, a simple README file. If the file didn’t exist before, and you run git status, you see your untracked file like so: </p> <p> $ echo 'My Project' > README</p> <p> $ git status</p> <p> On branch master</p> <p> Your branch is up-to-date with 'origin/master'.</p> <p>Untracked files: </p> <p>(use \"git add <file>...\" to include in what will be committed) </p> <p>README </p> <p> nothing added to commit but untracked files present (use \"git add\" to track)</p> <p> You can see that your new README file is untracked, because it’s under the “Untracked files” heading in your status output. Untracked basically means that Git sees a file you didn’t have in the previous snapshot (commit); Git won’t start including it in your commit snapshots until you explicitly tell it to do so. It does this so you don’t accidentally begin including generated binary files or other files that you did not mean to include. You do want to start including README, so let’s start tracking the file.</p>"}, {"title":"Tracking New Files ", "body":"<p>In order to begin tracking a new file, you use the command git add. To begin tracking the README file, you can run this: </p> <p>$ git add README </p> <p>If you run your status command again, you can see that your README file is now tracked and staged to be committed: </p> <p>$ git status </p> <p>On branch master </p> <p>Your branch is up-to-date with 'origin/master'. </p><p>Changes to be committed: </p>  <p> (use \"git reset HEAD <file>...\" to unstage) </p> <p>  new file:   README</p> <p> You can tell that it’s staged because it’s under the “Changes to be committed” heading. If you commit at this point, the version of the file at the time you ran git add is what will be in the historical snapshot. You may recall that when you ran git init earlier, you then ran git add <files> — that was to begin tracking files in your directory. The git add command takes a path name for either a file or a directory; if it’s a directory, the command adds all the files in that directory recursively.</p>"}, {"titile":"Staging Modified Files","body":"<p>Let’s change a file that was already tracked. If you change a previously tracked file called CONTRIBUTING.md and then run your git status command again, you get something that looks like this: </p> <p>$ git status </p> <p>On branch master </p> <p>Your branch is up-to-date with 'origin/master'. </p> <p>Changes to be committed: </p> <p> (use \"git reset HEAD <file>...\" to unstage)</p> <p>  new file:   README</p> <p> Changes not staged for commit:</p> <p> </p> <p> (use \"git add <file>...\" to update what will be committed)</p> <p> (use \"git checkout -- <file>...\" to discard changes in working directory)</p> <p> modified:   CONTRIBUTING.md </p> <p>The CONTRIBUTING.md file appears under a section named “Changes not staged for commit” — which means that a file that is tracked has been modified in the working directory but not yet staged. To stage it, you run the git add command. git add is a multipurpose command — you use it to begin tracking new files, to stage files, and to do other things like marking merge-conflicted files as resolved. It may be helpful to think of it more as “add precisely this content to the next commit” rather than “add this file to the project”. Let’s run git add now to stage the CONTRIBUTING.md file, and then run git status again: </p> <p>$ git add CONTRIBUTING.md </p> <p>$ git status </p> <p>On branch master </p> <p>Your branch is up-to-date with 'origin/master'. </p> <p>Changes to be committed: </p> <p> (use \"git reset HEAD <file>...\" to unstage)</p> <p> new file:   README </p> <p> modified:   CONTRIBUTING.md </p> <p>Both files are staged and will go into your next commit. At this point, suppose you remember one little change that you want to make in CONTRIBUTING.md before you commit it. You open it again and make that change, and you’re ready to commit. However, let’s run git status one more time: </p> <p>$ vim CONTRIBUTING.md </p> <p>$ git status </p> <p>On branch master </p> <p>Your branch is up-to-date with 'origin/master'. </p> <p>Changes to be committed: </p> <p>(use \"git reset HEAD <file>...\" to unstage)</p> <p>  new file:   README</p> <p>  modified:   CONTRIBUTING.md</p> <p> Changes not staged for commit:</p> <p>(use \"git add <file>...\" to update what will be committed) </p> <p>(use \"git checkout -- <file>...\" to discard changes in working directory)</p> <p> modified:   CONTRIBUTING.md </p> <p>What the heck? Now CONTRIBUTING.md is listed as both staged and unstaged. How is that possible? It turns out that Git stages a file exactly as it is when you run the git add command. If you commit now, the version of CONTRIBUTING.md as it was when you last ran the git add command is how it will go into the commit, not the version of the file as it looks in your working directory when you run git commit. If you modify a file after you run git add, you have to run git add again to stage the latest version of the file: </p> <p>$ git add CONTRIBUTING.md </p> <p>$ git status </p> <p>On branch master </p> <p>Your branch is up-to-date with 'origin/master'. </p> <p>Changes to be committed: </p> <p> (use \"git reset HEAD <file>...\" to unstage)</p> <p>new file:   README </p> <p>modified:   CONTRIBUTING.md </p> "}, {"title":"Short Status", "body":"<p> While the git status output is pretty comprehensive, it’s also quite wordy. Git also has a short status flag so you can see your changes in a more compact way. If you run git status -s or git status --short you get a far more simplified output from the command:</p> <p>$ git status -s  </p> <p> M README </p> <p>MM Rakefile  </p> <p> A  lib/git.rb </p> <p>M  lib/simplegit.rb  </p> <p> ?? LICENSE.txt</p> <p>New files that aren’t tracked have a ?? next to them, new files that have been added to the staging area have an A, modified files have an M and so on. There are two columns to the output - the left-hand column indicates the status of the staging area and the right-hand column indicates the status of the working tree. So for example in that output, the README file is modified in the working directory but not yet staged, while the lib/simplegit.rb file is modified and staged. The Rakefile was modified, staged and then modified again, so there are changes to it that are both staged and unstaged. </p>"}, {"title":"Ignoring Files", "body":"<p> Often, you’ll have a class of files that you don’t want Git to automatically add or even show you as being untracked. These are generally automatically generated files such as log files or files produced by your build system. In such cases, you can create a file listing patterns to match them named .gitignore. Here is an example .gitignore file:</p> <p>*.[oa]</p> <p>*~ </p> <p>The first line tells Git to ignore any files ending in “.o” or “.a” — object and archive files that may be the product of building your code. The second line tells Git to ignore all files whose names end with a tilde (~), which is used by many text editors such as Emacs to mark temporary files. You may also include a log, tmp, or pid directory; automatically generated documentation; and so on. Setting up a .gitignore file for your new repository before you get going is generally a good idea so you don’t accidentally commit files that you really don’t want in your Git repository. </p> <p>The rules for the patterns you can put in the .gitignore file are as follows: </p> <p>Blank lines or lines starting with # are ignored. </p> <p>Standard glob patterns work, and will be applied recursively throughout the entire working tree.</p> <p>You can start patterns with a forward slash (/) to avoid recursivity. </p> <p>You can end patterns with a forward slash (/) to specify a directory. </p> <p>You can negate a pattern by starting it with an exclamation point (!). </p> <p> Glob patterns are like simplified regular expressions that shells use. An asterisk (*) matches zero or more characters; [abc] matches any character inside the brackets (in this case a, b, or c); a question mark (?) matches a single character; and brackets enclosing characters separated by a hyphen ([0-9]) matches any character between them (in this case 0 through 9). You can also use two asterisks to match nested directories; a/**/z would match a/z, a/b/z, a/b/c/z, and so on. </p> <p>Here is another example .gitignore file: </p><p># ignore all .a files </p> <p> *.a </p> <p># but do track lib.a, even though you're ignoring .a files above</p> <p> !lib.a </p> <p># only ignore the TODO file in the current directory, not subdir/TODO </p> <p>/TODO</p> <p> # ignore all files in the build/ directory</p> <p> build/ </p> <p># ignore doc/notes.txt, but not doc/server/arch.txt </p> <p>doc/*.txt </p> <p># ignore all .pdf files in the doc/ directory and any of its subdirectories </p> <p>doc/**/*.pdf </p>"}, {"title":"Viewing Your Staged and Unstaged Changes", "body":"<p>If the git status command is too vague for you — you want to know exactly what you changed, not just which files were changed — you can use the git diff command. We’ll cover git diff in more detail later, but you’ll probably use it most often to answer these two questions: What have you changed but not yet staged? And what have you staged that you are about to commit? Although git status answers those questions very generally by listing the file names, git diff shows you the exact lines added and removed — the patch, as it were.</p> <p>Let’s say you edit and stage the README file again and then edit the CONTRIBUTING.md file without staging it. If you run your git status command, you once again see something like this:</p> <p>$ git status </p> <p>On branch master </p> <p>Your branch is up-to-date with 'origin/master'. </p> <p>Changes to be committed: </p> <p> (use \"git reset HEAD <file>...\" to unstage) </p> <p>  modified:   README</p> <p>Changes not staged for commit: </p> <p>(use \"git add <file>...\" to update what will be committed) </p> <p>(use \"git checkout -- <file>...\" to discard changes in working directory) </p> <p> modified:   CONTRIBUTING.md</p> "}, {"title":"Changed but not yet Staged", "body":"<p>To see what you’ve changed but not yet staged, type git diff with no other arguments: </p> <p>$ git diff </p> <p>That command compares what is in your working directory with what is in your staging area. The result tells you the changes you’ve made that you haven’t yet staged. </p> <p>If you want to see what you’ve staged that will go into your next commit, you can use git diff --staged. This command compares your staged changes to your last commit: </p> <p>$ git diff --staged </p> <p>diff --git a/README b/README </p> <p>new file mode 100644 </p> <p>index 0000000..03902a1 </p> <p>--- /dev/null </p> <p>+++ b/README </p> <p>@@ -0,0 +1 @@ </p> <p>+My Project </p> <p>It’s important to note that git diff by itself doesn’t show all changes made since your last commit — only changes that are still unstaged. This can be confusing, because if you’ve staged all of your changes, git diff will give you no output.</p>"}, { "title": "Another example", "body":" <p>For another example, if you stage the CONTRIBUTING.md file and then edit it, you can use git diff to see the changes in the file that are staged and the changes that are unstaged. If our environment looks like this: </p> <p>$ git add CONTRIBUTING.md </p> <p>$ echo '# test line' >> CONTRIBUTING.md </p> <p>$ git status </p> <p>On branch master </p> <p>Your branch is up-to-date with 'origin/master'. </p><p>Changes to be committed </p> <p>  (use \"git reset HEAD <file>...\" to unstage) </p> <p>modified:   CONTRIBUTING.md </p> <p>Changes not staged for commit: </p> <p>(use \"git add <file>...\" to update what will be committed) </p> <p>(use \"git checkout -- <file>...\" to discard changes in working directory)</p> <p>modified:   CONTRIBUTING.md </p> <p>Now you can use git diff to see what is still unstaged: </p> <p>$ git diff </p> <p>diff --git a/CONTRIBUTING.md b/CONTRIBUTING.md </p> <p>index 643e24f..87f08c8 100644 </p> <p>--- a/CONTRIBUTING.md </p> <p>+++ b/CONTRIBUTING.md </p> <p>@@ -119,3 +119,4 @@ at the </p> <p> ## Starter Projects </p> <p>See our [projects list](https://github.com/libgit2/libgit2/blob/development/PROJECTS.md).+# test line </p> <p>and git diff --cached to see what you’ve staged so far (--staged and --cached are synonyms): </p> <p>$ git diff --cached </p> <p>diff --git a/CONTRIBUTING.md b/CONTRIBUTING.md </p> <p>index 8ebb991..643e24f 100644 </p> <p>--- a/CONTRIBUTING.md </p> <p>+++ b/CONTRIBUTING.md </p> <p>@@ -65,7 +65,8 @@ branch directly, things can get messy. </p> <p>Please include a nice description of your changes when you submit your PR; </p> <p>if we have to read the whole diff to figure out why you're contributing </p> <p> in the first place, you're less likely to get feedback and have your change </p> <p>-merged in. </p> <p>+merged in. Also, split your changes into comprehensive chunks if your patch is </p> <p>+longer than a dozen lines. </p>"}, {"title":"Committing your Changes", "body":"<p>Now that your staging area is set up the way you want it, you can commit your changes. Remember that anything that is still unstaged — any files you have created or modified that you haven’t run git add on since you edited them — won’t go into this commit. They will stay as modified files on your disk. In this case, let’s say that the last time you ran git status, you saw that everything was staged, so you’re ready to commit your changes. The simplest way to commit is to type git commit: </p> <p>$ git commit </p> <p>Doing so launches your editor of choice. (This is set by your shell’s EDITOR environment variable — usually vim or emacs, although you can configure it with whatever you want using the git config --global core.editor command as you saw in Getting Started). </p> <p>The editor displays the following text (this example is a Vim screen): </p> <p># Please enter the commit message for your changes. Lines starting </p> <p># with '#' will be ignored, and an empty message aborts the commit. </p> <p># On branch master </p> <p># Your branch is up-to-date with 'origin/master'. </p> <p># </p> <p># Changes to be committed: </p> <p>#	new file:   README </p> <p>#	modified:   CONTRIBUTING.md </p> <p># </p> <p>~ </p> <p>~ </p> <p>~ </p> <p>\".git/COMMIT_EDITMSG\" 9L, 283C </p> <p>You can see that the default commit message contains the latest output of the git status command commented out and one empty line on top. You can remove these comments and type your commit message, or you can leave them there to help you remember what you’re committing. (For an even more explicit reminder of what you’ve modified, you can pass the -v option to git commit. Doing so also puts the diff of your change in the editor so you can see exactly what changes you’re committing.) When you exit the editor, Git creates your commit with that commit message (with the comments and diff stripped out). </p><p>Alternatively, you can type your commit message inline with the commit command by specifying it after a -m flag, like this: </p><p>$ git commit -m \"Story 182: Fix benchmarks for speed\" </p><p>[master 463dc4f] Story 182: Fix benchmarks for speed </p> <p>2 files changed, 2 insertions(+) </p>  <p>create mode 100644 README </p>  <p>Now you’ve created your first commit! You can see that the commit has given you some output about itself: which branch you committed to (master), what SHA-1 checksum the commit has (463dc4f), how many files were changed, and statistics about lines added and removed in the commit. </p> <p>Remember that the commit records the snapshot you set up in your staging area. Anything you didn’t stage is still sitting there modified; you can do another commit to add it to your history. Every time you perform a commit, you’re recording a snapshot of your project that you can revert to or compare to later. </p> "},
{"title":"Skipping the Staging Area", "body":"<p>Although it can be amazingly useful for crafting commits exactly how you want them, the staging area is sometimes a bit more complex than you need in your workflow. If you want to skip the staging area, Git provides a simple shortcut. Adding the -a option to the git commit command makes Git automatically stage every file that is already tracked before doing the commit, letting you skip the git add part: </p> <p>$ git status </p> <p>On branch master </p> <p>Your branch is up-to-date with 'origin/master'. </p> <p>Changes not staged for commit: </p> <p> (use \"git add <file>...\" to update what will be committed)</p> <p> (use \"git checkout -- <file>...\" to discard changes in working directory)</p> <p>  modified:   CONTRIBUTING.md </p> <p>no changes added to commit (use \"git add\" and/or \"git commit -a\") </p> <p> $ git commit -a -m 'added new benchmarks' </p>[master 83e38c7] added new benchmarks <p> 1 file changed, 5 insertions(+), 0 deletions(-) </p> <p>Notice how you don’t have to run git add on the CONTRIBUTING.md file in this case before you commit. That’s because the -a flag includes all changed files. This is convenient, but be careful; sometimes this flag will cause you to include unwanted changes. </p>"} 
] 
 ]
