[

{"title":"Working with Remotes","body":"<p> To be able to collaborate on any Git project, you need to know how to manage your remote repositories. Remote repositories are versions of your project that are hosted on the Internet or network somewhere. You can have several of them, each of which generally is either read-only or read/write for you. Collaborating with others involves managing these remote repositories and pushing and pulling data to and from them when you need to share work. Managing remote repositories includes knowing how to add remote repositories, remove remotes that are no longer valid, manage various remote branches and define them as being tracked or not, and more. In this section, we’ll cover some of these remote-management skills.</p> "},

{"title":"Showing Your Remotes","body":"<p>To see which remote servers you have configured, you can run the git remote command. It lists the shortnames of each remote handle you’ve specified. If you’ve cloned your repository, you should at least see origin — that is the default name Git gives to the server you cloned from: </p> <p>$ git clone https://github.com/schacon/ticgit </p><p>Cloning into 'ticgit'...</p><p>remote: Reusing existing pack: 1857, done.</p><p>remote: Total 1857 (delta 0), reused 0 (delta 0)</p><p>Receiving objects: 100% (1857/1857), 374.35 KiB | 268.00 KiB/s, done. </p><p>Resolving deltas: 100% (772/772), done. </p><p>Checking connectivity... done.</p><p>$ cd ticgit</p> <p>$ git remote<p></p>origin </p> <p>You can also specify -v, which shows you the URLs that Git has stored for the shortname to be used when reading and writing to that remote: </p> <p>$ git remote -v </p><p>origin	https://github.com/schacon/ticgit (fetch) </p><p>origin	https://github.com/schacon/ticgit (push) </p> <p>If you have more than one remote, the command lists them all. For example, a repository with multiple remotes for working with several collaborators might look something like this. </p> <p>$ cd grit </p><p>$ git remote -v </p><p>bakkdoor  https://github.com/bakkdoor/grit (fetch) </p><p>bakkdoor  https://github.com/bakkdoor/grit (push) </p><p>cho45     https://github.com/cho45/grit (fetch)</p><p>cho45     https://github.com/cho45/grit (push) </p><p>defunkt   https://github.com/defunkt/grit (fetch) </p><p> defunkt   https://github.com/defunkt/grit (push) </p><p>koke      git://github.com/koke/grit.git (fetch)</p><p>koke      git://github.com/koke/grit.git (push) </p><p>origin    git@github.com:mojombo/grit.git (fetch)</p><p>origin    git@github.com:mojombo/grit.git (push) </p> <p> This means we can pull contributions from any of these users pretty easily. We may additionally have permission to push to one or more of these, though we can’t tell that here.</p> <p>Notice that these remotes use a variety of protocols; we’ll cover more about this in Getting Git on a Server. </p>"},

{"title":"Adding Remote Repositories","body":"<p>We’ve mentioned and given some demonstrations of how the git clone command implicitly adds the origin remote for you. Here’s how to add a new remote explicitly. To add a new remote Git repository as a shortname you can reference easily, run git remote add <shortname> <url>:</p> <p>$ git remote</p><p>origin </p><p>$ git remote add pb https://github.com/paulboone/ticgit </p><p>$ git remote -v </p><p>origin	https://github.com/schacon/ticgit (fetch) </p><p>origin	https://github.com/schacon/ticgit (push) </p><p> pb	https://github.com/paulboone/ticgit (fetch) </p><p>pb	https://github.com/paulboone/ticgit (push) </p> <p>Now you can use the string pb on the command line in lieu of the whole URL. For example, if you want to fetch all the information that Paul has but that you don’t yet have in your repository, you can run git fetch pb: </p> <p>$ git fetch pb </p><p> remote: Counting objects: 43, done.</p><p> remote: Compressing objects: 100% (36/36), done. </p><p> remote: Total 43 (delta 10), reused 31 (delta 5) </p><p>Unpacking objects: 100% (43/43), done. </p><p> From https://github.com/paulboone/ticgit </p><p> * [new branch]      master     -> pb/master </p><p> * [new branch]      ticgit     -> pb/ticgit </p> <p>Paul’s master branch is now accessible locally as pb/master — you can merge it into one of your branches, or you can check out a local branch at that point if you want to inspect it. (We’ll go over what branches are and how to use them in much more detail in Git Branching.) </p>"}

{
	"title":"Fetching and Pulling from Your Remotes", "body":"<p> As you just saw, to get data from your remote projects, you can run:</p> <p>$ git fetch <remote> </p> <p>The command goes out to that remote project and pulls down all the data from that remote project that you don’t have yet. After you do this, you should have references to all the branches from that remote, which you can merge in or inspect at any time. </p> <p>If you clone a repository, the command automatically adds that remote repository under the name “origin”. So, git fetch origin fetches any new work that has been pushed to that server since you cloned (or last fetched from) it. It’s important to note that the git fetch command only downloads the data to your local repository — it doesn’t automatically merge it with any of your work or modify what you’re currently working on. You have to merge it manually into your work when you’re ready. </p> <p> If your current branch is set up to track a remote branch (see the next section and Git Branching for more information), you can use the git pull command to automatically fetch and then merge that remote branch into your current branch. This may be an easier or more comfortable workflow for you; and by default, the git clone command automatically sets up your local master branch to track the remote master branch (or whatever the default branch is called) on the server you cloned from. Running git pull generally fetches data from the server you originally cloned from and automatically tries to merge it into the code you’re currently working on. </p> "
}

{
	"title":"Pushing to Your Remotes","body":"<p>When you have your project at a point that you want to share, you have to push it upstream. The command for this is simple: git push <remote> <branch>. If you want to push your master branch to your origin server (again, cloning generally sets up both of those names for you automatically), then you can run this to push any commits you’ve done back up to the server: </p> <p> $ git push origin master </p> <p>This command works only if you cloned from a server to which you have write access and if nobody has pushed in the meantime. If you and someone else clone at the same time and they push upstream and then you push upstream, your push will rightly be rejected. You’ll have to fetch their work first and incorporate it into yours before you’ll be allowed to push. See Git Branching for more detailed information on how to push to remote servers. </p>"
}

{

	"title":"Inspecting a Remote", "body":"<p>If you want to see more information about a particular remote, you can use the git remote show <remote> command. If you run this command with a particular shortname, such as origin, you get something like this: </p> <p>$ git remote show origin</p><p>* remote origin </p><p>  Fetch URL: https://github.com/schacon/ticgit </p><p>  Push  URL: https://github.com/schacon/ticgit </p><p>  HEAD branch: master </p><p>  Remote branches: </p><p>    master                               tracked </p><p>    dev-branch                           tracked </p><p>  Local branch configured for 'git pull': </p><p>    master merges with remote master </p><p>  Local ref configured for 'git push': </p><p>    master pushes to master (up to date) </p> <p>This command shows which branch is automatically pushed to when you run git push while on certain branches. It also shows you which remote branches on the server you don’t yet have, which remote branches you have that have been removed from the server, and multiple local branches that are able to merge automatically with their remote-tracking branch when you run git pull. </p> "
}
{
	"title":"Renaming and Removing Remotes", "body":"<p> You can run git remote rename to change a remote’s shortname. For instance, if you want to rename pb to paul, you can do so with git remote rename:</p> <p>$ git remote rename pb paul </p><p>$ git remote </p><p>origin </p><p> paul </p> <p>It’s worth mentioning that this changes all your remote-tracking branch names, too. What used to be referenced at pb/master is now at paul/master. </p> <p>If you want to remove a remote for some reason — you’ve moved the server or are no longer using a particular mirror, or perhaps a contributor isn’t contributing anymore — you can either use git remote remove or git remote rm: </p> <p>$ git remote remove paul </p><p>$ git remote </p><p>origin </p> <p>Once you delete the reference to a remote this way, all remote-tracking branches and configuration settings associated with that remote are also deleted. </p>"
}
]
