{
  "lesson": [
    {
      "title": "Undoing things",
      "body": "<p>At any stage, you may want to undo something. Here, we’ll review a few basic tools for undoing changes that you’ve made. Be careful, because you can’t always undo some of these undos. This is one of the few areas in Git where you may lose some work if you do it wrong.</p> <p> One of the common undos takes place when you commit too early and possibly forget to add some files, or you mess up your commit message. If you want to redo that commit, make the additional changes you forgot, stage them, and commit again using the --amend option:</p> <p> $ git commit --amend</p> <p> This command takes your staging area and uses it for the commit. If you’ve made no changes since your last commit (for instance, you run this command immediately after your previous commit), then your snapshot will look exactly the same, and all you’ll change is your commit message.</p> <p> The same commit-message editor fires up, but it already contains the message of your previous commit. You can edit the message the same as always, but it overwrites your previous commit.</p> <p> As an example, if you commit and then realize you forgot to stage the changes in a file you wanted to add to this commit, you can do something like this:</p> <p>$ git commit -m 'initial commit' </p><p> $ git add forgotten_file </p><p>$ git commit --amend </p> <p> You end up with a single commit — the second commit replaces the results of the first.</p>"
    },
    {
      "title": "Unstaging a Staged File",
      "body": "<p>The next two sections demonstrate how to work with your staging area and working directory changes. The nice part is that the command you use to determine the state of those two areas also reminds you how to undo changes to them. For example, let’s say you’ve changed two files and want to commit them as two separate changes, but you accidentally type git add * and stage them both. How can you unstage one of the two? The git status command reminds you:</p> <p>$ git add * </p><p> $ git status </p><p>On branch master</p><p>Changes to be committed:</p><p>  (use \"git reset HEAD <file>...\" to unstage)</p><p>    renamed:    README.md -> README </p><p>    modified:   CONTRIBUTING.md</p> <p> Right below the “Changes to be committed” text, it says use git reset HEAD <file>... to unstage. So, let’s use that advice to unstage the CONTRIBUTING.md file:</p> <p> $ git reset HEAD CONTRIBUTING.md </p><p>Unstaged changes after reset: </p><p>MCONTRIBUTING.md </p><p>$ git status </p><p>On branch master </p><p>Changes to be committed: </p><p>  (use \"git reset HEAD <file>...\" to unstage) </p><p>    renamed:    README.md -> README </p><p>Changes not staged for commit: </p><p>  (use \"git add <file>...\" to update what will be committed)</p><p>  (use \"git checkout -- <file>...\" to discard changes in working directory)</p><p>    modified:   CONTRIBUTING.md</p> <p>The command is a bit strange, but it works. The CONTRIBUTING.md file is modified but once again unstaged.</p>"
    },
    {
      "title": "Unmodifying a Modified File",
      "body": "<p>What if you realize that you don’t want to keep your changes to the CONTRIBUTING.md file? How can you easily unmodify it — revert it back to what it looked like when you last committed (or initially cloned, or however you got it into your working directory)? Luckily, git status tells you how to do that, too. In the last example output, the unstaged area looks like this:</p> <p>Changes not staged for commit:</p><p>  (use \"git add <file>...\" to update what will be committed) </p><p>  (use \"git checkout -- <file>...\" to discard changes in working directory) </p><p>    modified:   CONTRIBUTING.md </p> <p>It tells you pretty explicitly how to discard the changes you’ve made. Let’s do what it says: </p> <p>$ git checkout -- CONTRIBUTING.md </p><p>$ git status </p><p>On branch master </p><p>Changes to be committed: </p><p>  (use \"git reset HEAD <file>...\" to unstage)</p><p>    renamed:    README.md -> README </p> <p>You can see that the changes have been reverted. </p> <p>If you would like to keep the changes you’ve made to that file but still need to get it out of the way for now, we’ll go over stashing and branching in Git Branching; these are generally better ways to go.</p><p> Remember, anything that is committed in Git can almost always be recovered. Even commits that were on branches that were deleted or commits that were overwritten with an --amend commit can be recovered (see Data Recovery for data recovery). However, anything you lose that was never committed is likely never to be seen again.</p>"
    }
  ]
}